html/org-pages/qc/week5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-30 sáb 18:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Week 5 - my own writings</title>
<meta name="author" content="Luís Guilherme Miranda Spengler" />
<meta name="description" content="Week 5 - my own writings" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Week 5 - my own writings</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org711cc29">1. Week 5 (Qubit by Qubit)</a>
<ul>
<li><a href="#org89282d7">1.1. RECAP:</a>
<ul>
<li><a href="#org11181aa">1.1.1. The Bloch Sphere:</a></li>
<li><a href="#org37a23a9">1.1.2. Quantum gates:</a></li>
</ul>
</li>
<li><a href="#orgb8a59f6">1.2. Z gate</a>
<ul>
<li><a href="#orgc19c47a">1.2.1. Rules:</a></li>
</ul>
</li>
<li><a href="#org76a14bf">1.3. Quantum measurements</a>
<ul>
<li><a href="#org95aa950">1.3.1. Quantum Circuit model</a></li>
<li><a href="#orgf60c048">1.3.2. Some results</a></li>
</ul>
</li>
<li><a href="#org28e169b">1.4. Wave-particle duality and measurement</a></li>
<li><a href="#org357fab9">1.5. IQX circuit composer</a></li>
<li><a href="#orgfc000d7">1.6. A Theory</a></li>
<li><a href="#orgc002e35">1.7. Articles</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org711cc29" class="outline-2">
<h2 id="org711cc29"><span class="section-number-2">1.</span> Week 5 (Qubit by Qubit)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org89282d7" class="outline-3">
<h3 id="org89282d7"><span class="section-number-3">1.1.</span> RECAP:</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org11181aa" class="outline-4">
<h4 id="org11181aa"><span class="section-number-4">1.1.1.</span> The Bloch Sphere:</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>State on the top: \(|0\rangle\)</li>
<li>State on the bottom: \(|1\rangle\)</li>
<li>State pointing torwards: \(|+\rangle\)</li>
<li>State pointing backwards: \(|-\rangle\)</li>
</ul>
</div>
</div>

<div id="outline-container-org37a23a9" class="outline-4">
<h4 id="org37a23a9"><span class="section-number-4">1.1.2.</span> Quantum gates:</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>X gate</li>
<li>Hadamard gate</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb8a59f6" class="outline-3">
<h3 id="orgb8a59f6"><span class="section-number-3">1.2.</span> Z gate</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>The Z gate does a 180º rotation around the Z axis (like a carrosel)</li>
<li>Z axis is the one pointing upwards.</li>
</ul>
</div>

<div id="outline-container-orgc19c47a" class="outline-4">
<h4 id="orgc19c47a"><span class="section-number-4">1.2.1.</span> Rules:</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>If we apply the Z gate to the \(|0\rangle\) state, nothing will change because the \(|0\rangle\) lies on the Z axis.</li>
<li>Applying it to a superpostion makes more sense: \(|+\rangle\) becomes \(|-\rangle\) and \(|+\rangle\) becomes \(|-\rangle\)</li>
<li>If we apply the Z gate to the \(|1\rangle\) state, it becomes \(-|1\rangle\) (Changing its fase, subject for next week!!!)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org76a14bf" class="outline-3">
<h3 id="org76a14bf"><span class="section-number-3">1.3.</span> Quantum measurements</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>We need to measure the qubits so we can understand what state they are in.</li>
<li>By observing (measuring) a quantum state, we can change it.</li>
<li>The outcome of a quantum measurement is oftem random.
<ul class="org-ul">
<li>We don&rsquo;t know why this happens, but it is scientifically proven.</li>
</ul></li>
<li>When we measure a quantum circuit you are asking if it is either in \(|0\rangle\) or \(|1\rangle\) state.</li>
</ul>
</div>

<div id="outline-container-org95aa950" class="outline-4">
<h4 id="org95aa950"><span class="section-number-4">1.3.1.</span> Quantum Circuit model</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>The quantum circuit model shows us three parts of a quantum circuit</li>
<li>States, Gates, Measurement
<ul class="org-ul">
<li>Measurement is a crucial state (without it, we don&rsquo;t get an answer and the goal here is to get an answer!)</li>
</ul></li>
<li>The dial symbol (insert image later!!!!!!!!!) is how we represent measurements in a circuit.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf60c048" class="outline-4">
<h4 id="orgf60c048"><span class="section-number-4">1.3.2.</span> Some results</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Input: \(|0\rangle\), you measure it and it is \(|0\rangle\)</li>
<li>Input: \(|1\rangle\), you measure it and it is \(|1\rangle\)</li>
<li>Measuring a superpostion it is fundamentally random. It can be either \(|0\rangle\) or \(|1\rangle\) at any measurement (the act of measuring itself changes the result). This is known as <b>collapse</b> or <b>wave-function collapse</b>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org28e169b" class="outline-3">
<h3 id="org28e169b"><span class="section-number-3">1.4.</span> Wave-particle duality and measurement</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Qubits can be represented as waves too.</li>
<li>Q: Just like the dirac notation and the bloch sphere notation, is there a way of representing qubits as waves using notations? or is it useful to do so?</li>
<li>A: Typically the Dirac notation is used to talk about wavefunctions</li>
<li>Measurement inherently affects the wavefunction of your quantum object.</li>
<li>Just like to determine the probability of a coin being heads or tails, you measure again and again (hundreds, thousands, or even tens of thousands of times), to find a probability.</li>
<li>Quote Richard Feynman about probability.</li>
<li>Article: Using the un Bob Yirka</li>
<li>: What if the reason quantum states change when we measure them is because just like in real world we see objects and things using light (light reflects on something and comes to our eyes). The point is, light kinda touches the object. A quantum state is so sensible to the envirorment that its nature is changed by any means of interactions</li>
</ul>
</div>
</div>

<div id="outline-container-org357fab9" class="outline-3">
<h3 id="org357fab9"><span class="section-number-3">1.5.</span> IQX circuit composer</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>In IBM quantum experience you can find it: <a href="https://quantum-computing.ibm.com/composer/">https://quantum-computing.ibm.com/composer/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfc000d7" class="outline-3">
<h3 id="orgfc000d7"><span class="section-number-3">1.6.</span> A Theory</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>What if the reason quantum states change when we measure them is because just like in real world we see objects and things using light (light reflects on something and comes to our eyes). The point is, light kinda touches the object. A quantum state is so sensible to the envirorment that its nature is changed by any means of interactions with matter and the simple act of looking (measuring it) at it changes it. So, nowadays there is no way of measuring a quantum state without making a particle or wave touch this quantum object, therefore the measurement property of changing results will continue to occur.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc002e35" class="outline-3">
<h3 id="orgc002e35"><span class="section-number-3">1.7.</span> Articles</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<a href="https://www.forbes.com/sites/startswithabang/2020/12/10/does-making-a-quantum-measurement-really-destroy-information/">https://www.forbes.com/sites/startswithabang/2020/12/10/does-making-a-quantum-measurement-really-destroy-information/</a>
<a href="https://www.science.org/doi/abs/10.1126/science.1109541">https://www.science.org/doi/abs/10.1126/science.1109541</a>
<a href="https://phys.org/news/2020-02-scientists-quantum.html">https://phys.org/news/2020-02-scientists-quantum.html</a>
<a href="http://backreaction.blogspot.com/2019/10/what-is-quantum-measurement-problem.html">http://backreaction.blogspot.com/2019/10/what-is-quantum-measurement-problem.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Guilherme Miranda Spengler</p>
<p class="date">Created: 2021-10-30 sáb 18:43</p>
</div>
</body>
</html>
